tutorials/mhdBuoyantBoussinesqPiso4PCMFoam/cavity/0/B
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      B;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions		[1 0 -2 0 0 -1 0];

internalField		uniform (1.3e2 0 0);//Ha=1

boundaryField
{
    left
    {
        type            fixedValue;
        value           uniform (1.3e2 0 0);
    }

    right
    {
        type            fixedValue;
        value           uniform (1.3e2 0 0);
    }

    ".*"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
