tutorials/mhdBuoyantBoussinesqPiso4PCMFoam/cavity/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default				Euler;
}

gradSchemes
{
    default				Gauss linear;
}

divSchemes
{
    default				none;
    div(phi,U)				Gauss upwind;
    div((phi*interpolate((rho*Cp))),T)	bounded Gauss upwind;
    div(phi,k)				Gauss upwind;
    div(phi,epsilon)			Gauss upwind;
    div(phi,R)				Gauss upwind;
    div(R)				Gauss linear;
    div((nuEff*dev(T(grad(U)))))	Gauss linear;
    div(phi,alphai)			Gauss upwind;
    div(phiB,U)				Gauss linear;
    div(phi,B)				Gauss linear;
    div(phiB,((2*DBU)*B))		Gauss linear;
}

laplacianSchemes
{
    default				Gauss linear corrected;
    laplacian(nuEff,U)			Gauss linear corrected;
    laplacian((1|A(U)),p)		Gauss linear corrected;
    laplacian(kappaEff,T)		Gauss linear corrected;
    laplacian(DkEff,k)			Gauss linear corrected;
    laplacian(DepsilonEff,epsilon)	Gauss linear corrected;
    laplacian(DREff,R)			Gauss linear corrected;
    laplacian(kappaEff,T)		Gauss linear corrected;
    laplacian(DB,B)			Gauss linear corrected;
    laplacian((1|A(B)),pB)		Gauss linear corrected;
}

interpolationSchemes
{
    default				linear;
}

snGradSchemes
{
    default				corrected;
}


// ************************************************************************* //
